{
    "<PAD>": 0,
    "<FACT>": 1,
    "<QUERY>": 2,
    "<STATE>": 3,
    "<ANSWER>": 4,
    "<UNKNOWN_WORD>": 5,
    "<HAS>": 6,
    "<TYPE>": 7,
    "<IS>": 8,
    "<UNKNOWN_TYPE>": 9,
    "<TYPE_NORMAL>": 10,
    "<TYPE_FIRE>": 11,
    "<TYPE_WATER>": 12,
    "<TYPE_GRASS>": 13,
    "<TYPE_ELECTRIC>": 14,
    "<TYPE_ICE>": 15,
    "<TYPE_FIGHTING>": 16,
    "<TYPE_POISON>": 17,
    "<TYPE_GROUND>": 18,
    "<TYPE_FLYING>": 19,
    "<TYPE_PSYCHIC>": 20,
    "<TYPE_BUG>": 21,
    "<TYPE_ROCK>": 22,
    "<TYPE_GHOST>": 23,
    "<TYPE_DRAGON>": 24,
    "<ACTION_USE>": 30,
    "<TARGET_AGAINST>": 31,
    "<TARGET_ON>": 32,
    "<EFFECT_SUPER>": 33,
    "<EFFECT_NORMAL>": 34,
    "<EFFECT_WEAK>": 35,
    "<EFFECT_NONE>": 36,
    "<TURN>": 50,
    "<HP_REMAINING>": 51,
    "<FAINTED>": 52,
    "<BATTLE_WON>": 53,
    "<BATTLE_LOST>": 54,
    "<LOGIC_AND>": 70,
    "<LOGIC_OR>": 71,
    "<LOGIC_NOT>": 72,
    "<UNKNOWN_MOVE>": 100,
    "<MOVE_TACKLE>": 101,
    "<MOVE_QUICK_ATTACK>": 102,
    "<MOVE_SCRATCH>": 103,
    "<MOVE_EMBER>": 104,
    "<MOVE_WATER_GUN>": 105,
    "<MOVE_BUBBLE>": 106,
    "<MOVE_VINE_WHIP>": 107,
    "<MOVE_ABSORB>": 108,
    "<MOVE_THUNDERSHOCK>": 109,
    "<MOVE_AURORA_BEAM>": 110,
    "<MOVE_LOW_KICK>": 111,
    "<MOVE_POISON_STING>": 112,
    "<MOVE_ACID>": 113,
    "<MOVE_EARTHQUAKE>": 114,
    "<MOVE_BONE_CLUB>": 115,
    "<MOVE_PECK>": 116,
    "<MOVE_WING_ATTACK>": 117,
    "<MOVE_CONFUSION>": 118,
    "<MOVE_LEECH_LIFE>": 119,
    "<MOVE_ROCK_THROW>": 120,
    "<MOVE_LICK>": 121,
    "<MOVE_DRAGON_RAGE>": 122,
    "<MOVE_HYPER_BEAM>": 123,
    "<MOVE_FIRE_BLAST>": 124,
    "<MOVE_BLIZZARD>": 125,
    "<MOVE_HYDRO_PUMP>": 126,
    "<MOVE_TOXIC>": 127,
    "<MOVE_SLUDGE>": 128,
    "<MOVE_SKY_ATTACK>": 129,
    "<MOVE_PSYCHIC>": 130,
    "<MOVE_PSYBEAM>": 131,
    "<MOVE_PSYWAVE>": 132,
    "<MOVE_RECOVER>": 133,
    "<MOVE_REFLECT>": 134,
    "<MOVE_LIGHT_SCREEN>": 135,
    "<MOVE_SUBMISSION>": 136,
    "<MOVE_FISSURE>": 137,
    "<MOVE_NIGHT_SHADE>": 138,
    "<MOVE_CONFUSE_RAY>": 139,
    "<MOVE_GLARE>": 140,
    "<MOVE_BITE>": 141,
    "<MOVE_TAKE_DOWN>": 142,
    "<MOVE_STOMP>": 143,
    "<MOVE_BUBBLEBEAM>": 144,
    "<MOVE_SONICBOOM>": 145,
    "<MOVE_MEGA_DRAIN>": 146,
    "<MOVE_LEECH_SEED>": 147,
    "<MOVE_STUN_SPORE>": 148,
    "<MOVE_SLEEP_POWDER>": 149,
    "<MOVE_SOLARBEAM>": 150,
    "<MOVE_AGILITY>": 151,
    "<MOVE_SUPERSONIC>": 152,
    "<MOVE_LOVELY_KISS>": 153,
    "<MOVE_ICE_PUNCH>": 154,
    "<MOVE_THUNDERPUNCH>": 155,
    "<MOVE_FIRE_PUNCH>": 156,
    "<MOVE_THUNDER_WAVE>": 157,
    "<MOVE_ROAR>": 158,
    "<MOVE_BIDE>": 159,
    "<MOVE_TELEPORT>": 160,
    "<MOVE_HYPER_FANG>": 161,
    "<MOVE_HYPNOSIS>": 162,
    "<MOVE_BARRAGE>": 163,
    "<MOVE_RAGE>": 164,
    "<MOVE_GROWTH>": 165,
    "<MOVE_FIRE_SPIN>": 166,
    "<MOVE_SLASH>": 167,
    "<MOVE_SPIKE_CANNON>": 168,
    "<MOVE_BODY_SLAM>": 169,
    "<MOVE_REST>": 170,
    "<MOVE_SWIFT>": 171,
    "<MOVE_GROWL>": 172,
    "<MOVE_LEER>": 173,
    "<MOVE_SAND_ATTACK>": 174,
    "<MOVE_GUST>": 175,
    "<MOVE_POISON_POWDER>": 176,
    "<UNKNOWN_PKMN>": 1000,
    "<PKMN_BULBASAUR>": 1001,
    "<PKMN_IVYSAUR>": 1002,
    "<PKMN_VENUSAUR>": 1003,
    "<PKMN_CHARMANDER>": 1004,
    "<PKMN_CHARMELEON>": 1005,
    "<PKMN_CHARIZARD>": 1006,
    "<PKMN_SQUIRTLE>": 1007,
    "<PKMN_WARTORTLE>": 1008,
    "<PKMN_BLASTOISE>": 1009,
    "<PKMN_CATERPIE>": 1010,
    "<PKMN_METAPOD>": 1011,
    "<PKMN_BUTTERFREE>": 1012,
    "<PKMN_WEEDLE>": 1013,
    "<PKMN_KAKUNA>": 1014,
    "<PKMN_BEEDRILL>": 1015,
    "<PKMN_PIDGEY>": 1016,
    "<PKMN_PIDGEOTTO>": 1017,
    "<PKMN_PIDGEOT>": 1018,
    "<PKMN_RATTATA>": 1019,
    "<PKMN_RATICATE>": 1020,
    "<PKMN_SPEAROW>": 1021,
    "<PKMN_FEAROW>": 1022,
    "<PKMN_EKANS>": 1023,
    "<PKMN_ARBOK>": 1024,
    "<PKMN_PIKACHU>": 1025,
    "<PKMN_RAICHU>": 1026,
    "<PKMN_SANDSHREW>": 1027,
    "<PKMN_SANDSLASH>": 1028,
    "<PKMN_NIDORAN_F>": 1029,
    "<PKMN_NIDORINA>": 1030,
    "<PKMN_NIDOQUEEN>": 1031,
    "<PKMN_NIDORAN_M>": 1032,
    "<PKMN_NIDORINO>": 1033,
    "<PKMN_NIDOKING>": 1034,
    "<PKMN_CLEFAIRY>": 1035,
    "<PKMN_CLEFABLE>": 1036,
    "<PKMN_VULPIX>": 1037,
    "<PKMN_NINETALES>": 1038,
    "<PKMN_JIGGLYPUFF>": 1039,
    "<PKMN_WIGGLYTUFF>": 1040,
    "<PKMN_ZUBAT>": 1041,
    "<PKMN_GOLBAT>": 1042,
    "<PKMN_ODDISH>": 1043,
    "<PKMN_GLOOM>": 1044,
    "<PKMN_VILEPLUME>": 1045,
    "<PKMN_PARAS>": 1046,
    "<PKMN_PARASECT>": 1047,
    "<PKMN_VENONAT>": 1048,
    "<PKMN_VENOMOTH>": 1049,
    "<PKMN_DIGLETT>": 1050,
    "<PKMN_DUGTRIO>": 1051,
    "<PKMN_MEOWTH>": 1052,
    "<PKMN_PERSIAN>": 1053,
    "<PKMN_PSYDUCK>": 1054,
    "<PKMN_GOLDUCK>": 1055,
    "<PKMN_MANKEY>": 1056,
    "<PKMN_PRIMEAPE>": 1057,
    "<PKMN_GROWLITHE>": 1058,
    "<PKMN_ARCANINE>": 1059,
    "<PKMN_POLIWAG>": 1060,
    "<PKMN_POLIWHIRL>": 1061,
    "<PKMN_POLIWRATH>": 1062,
    "<PKMN_ABRA>": 1063,
    "<PKMN_KADABRA>": 1064,
    "<PKMN_ALAKAZAM>": 1065,
    "<PKMN_MACHOP>": 1066,
    "<PKMN_MACHOKE>": 1067,
    "<PKMN_MACHAMP>": 1068,
    "<PKMN_BELLSPROUT>": 1069,
    "<PKMN_WEEPINBELL>": 1070,
    "<PKMN_VICTREEBEL>": 1071,
    "<PKMN_TENTACOOL>": 1072,
    "<PKMN_TENTACRUEL>": 1073,
    "<PKMN_GEODUDE>": 1074,
    "<PKMN_GRAVELER>": 1075,
    "<PKMN_GOLEM>": 1076,
    "<PKMN_PONYTA>": 1077,
    "<PKMN_RAPIDASH>": 1078,
    "<PKMN_SLOWPOKE>": 1079,
    "<PKMN_SLOWBRO>": 1080,
    "<PKMN_MAGNEMITE>": 1081,
    "<PKMN_MAGNETON>": 1082,
    "<PKMN_FARFETCH'D>": 1083,
    "<PKMN_DODUO>": 1084,
    "<PKMN_DODRIO>": 1085,
    "<PKMN_SEEL>": 1086,
    "<PKMN_DEWGONG>": 1087,
    "<PKMN_GRIMER>": 1088,
    "<PKMN_MUK>": 1089,
    "<PKMN_SHELLDER>": 1090,
    "<PKMN_CLOYSTER>": 1091,
    "<PKMN_GASTLY>": 1092,
    "<PKMN_HAUNTER>": 1093,
    "<PKMN_GENGAR>": 1094,
    "<PKMN_ONIX>": 1095,
    "<PKMN_DROWZEE>": 1096,
    "<PKMN_HYPNO>": 1097,
    "<PKMN_KRABBY>": 1098,
    "<PKMN_KINGLER>": 1099,
    "<PKMN_VOLTORB>": 1100,
    "<PKMN_ELECTRODE>": 1101,
    "<PKMN_EXEGGCUTE>": 1102,
    "<PKMN_EXEGGUTOR>": 1103,
    "<PKMN_CUBONE>": 1104,
    "<PKMN_MAROWAK>": 1105,
    "<PKMN_HITMONLEE>": 1106,
    "<PKMN_HITMONCHAN>": 1107,
    "<PKMN_LICKITUNG>": 1108,
    "<PKMN_KOFFING>": 1109,
    "<PKMN_WEEZING>": 1110,
    "<PKMN_RHYHORN>": 1111,
    "<PKMN_RHYDON>": 1112,
    "<PKMN_CHANSEY>": 1113,
    "<PKMN_TANGELA>": 1114,
    "<PKMN_KANGASKHAN>": 1115,
    "<PKMN_HORSEA>": 1116,
    "<PKMN_SEADRA>": 1117,
    "<PKMN_GOLDEEN>": 1118,
    "<PKMN_SEAKING>": 1119,
    "<PKMN_STARYU>": 1120,
    "<PKMN_STARMIE>": 1121,
    "<PKMN_MR._MIME>": 1122,
    "<PKMN_SCYTHER>": 1123,
    "<PKMN_JYNX>": 1124,
    "<PKMN_ELECTABUZZ>": 1125,
    "<PKMN_MAGMAR>": 1126,
    "<PKMN_PINSIR>": 1127,
    "<PKMN_TAUROS>": 1128,
    "<PKMN_MAGIKARP>": 1129,
    "<PKMN_GYARADOS>": 1130,
    "<PKMN_LAPRAS>": 1131,
    "<PKMN_DITTO>": 1132,
    "<PKMN_EEVEE>": 1133,
    "<PKMN_VAPOREON>": 1134,
    "<PKMN_JOLTEON>": 1135,
    "<PKMN_FLAREON>": 1136,
    "<PKMN_PORYGON>": 1137,
    "<PKMN_OMANYTE>": 1138,
    "<PKMN_OMASTAR>": 1139,
    "<PKMN_KABUTO>": 1140,
    "<PKMN_KABUTOPS>": 1141,
    "<PKMN_AERODACTYL>": 1142,
    "<PKMN_SNORLAX>": 1143,
    "<PKMN_ARTICUNO>": 1144,
    "<PKMN_ZAPDOS>": 1145,
    "<PKMN_MOLTRES>": 1146,
    "<PKMN_DRATINI>": 1147,
    "<PKMN_DRAGONAIR>": 1148,
    "<PKMN_DRAGONITE>": 1149,
    "<PKMN_MEWTWO>": 1150,
    "<PKMN_MEW>": 1151
}