{
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "<UNKNOWN_WORD>": 5,
    "<FACT>": 10,
    "<QUERY>": 11,
    "<STATE>": 12,
    "<ANSWER>": 13,
    "<BATTLE>": 14,
    "<TURN>": 30,
    "<HP_REMAINING>": 31,
    "<FAINTED>": 32,
    "<BATTLE_WON>": 33,
    "<BATTLE_LOST>": 34,
    "<HAS>": 35,
    "<IS>": 36,
    "<TYPE>": 37,
    "<ACTION_USE>": 38,
    "<TARGET_AGAINST>": 39,
    "<TARGET_ON>": 40,
    "<EFFECT_SUPER>": 41,
    "<EFFECT_NORMAL>": 42,
    "<EFFECT_WEAK>": 43,
    "<EFFECT_NONE>": 44,
    "<LOGIC_AND>": 70,
    "<LOGIC_OR>": 71,
    "<LOGIC_NOT>": 72,
    "<UNKNOWN_TYPE>": 100,
    "<TYPE_NORMAL>": 101,
    "<TYPE_FIRE>": 102,
    "<TYPE_WATER>": 103,
    "<TYPE_GRASS>": 104,
    "<TYPE_ELECTRIC>": 105,
    "<TYPE_ICE>": 106,
    "<TYPE_FIGHTING>": 107,
    "<TYPE_POISON>": 108,
    "<TYPE_GROUND>": 109,
    "<TYPE_FLYING>": 110,
    "<TYPE_PSYCHIC>": 111,
    "<TYPE_BUG>": 112,
    "<TYPE_ROCK>": 113,
    "<TYPE_GHOST>": 114,
    "<TYPE_DRAGON>": 115,
    "<UNKNOWN_MOVE>": 200,
    "<MOVE_TACKLE>": 201,
    "<MOVE_QUICK_ATTACK>": 202,
    "<MOVE_SCRATCH>": 203,
    "<MOVE_EMBER>": 204,
    "<MOVE_WATER_GUN>": 205,
    "<MOVE_BUBBLE>": 206,
    "<MOVE_VINE_WHIP>": 207,
    "<MOVE_ABSORB>": 208,
    "<MOVE_THUNDERSHOCK>": 209,
    "<MOVE_AURORA_BEAM>": 210,
    "<MOVE_LOW_KICK>": 211,
    "<MOVE_POISON_STING>": 212,
    "<MOVE_ACID>": 213,
    "<MOVE_EARTHQUAKE>": 214,
    "<MOVE_BONE_CLUB>": 215,
    "<MOVE_PECK>": 216,
    "<MOVE_WING_ATTACK>": 217,
    "<MOVE_CONFUSION>": 218,
    "<MOVE_LEECH_LIFE>": 219,
    "<MOVE_ROCK_THROW>": 220,
    "<MOVE_LICK>": 221,
    "<MOVE_DRAGON_RAGE>": 222,
    "<MOVE_HYPER_BEAM>": 223,
    "<MOVE_FIRE_BLAST>": 224,
    "<MOVE_BLIZZARD>": 225,
    "<MOVE_HYDRO_PUMP>": 226,
    "<MOVE_TOXIC>": 227,
    "<MOVE_SLUDGE>": 228,
    "<MOVE_SKY_ATTACK>": 229,
    "<MOVE_PSYCHIC>": 230,
    "<MOVE_PSYBEAM>": 231,
    "<MOVE_PSYWAVE>": 232,
    "<MOVE_RECOVER>": 233,
    "<MOVE_REFLECT>": 234,
    "<MOVE_LIGHT_SCREEN>": 235,
    "<MOVE_SUBMISSION>": 236,
    "<MOVE_FISSURE>": 237,
    "<MOVE_NIGHT_SHADE>": 238,
    "<MOVE_CONFUSE_RAY>": 239,
    "<MOVE_GLARE>": 240,
    "<MOVE_BITE>": 241,
    "<MOVE_TAKE_DOWN>": 242,
    "<MOVE_STOMP>": 243,
    "<MOVE_BUBBLEBEAM>": 244,
    "<MOVE_SONICBOOM>": 245,
    "<MOVE_MEGA_DRAIN>": 246,
    "<MOVE_LEECH_SEED>": 247,
    "<MOVE_STUN_SPORE>": 248,
    "<MOVE_SLEEP_POWDER>": 249,
    "<MOVE_SOLARBEAM>": 250,
    "<MOVE_AGILITY>": 251,
    "<MOVE_SUPERSONIC>": 252,
    "<MOVE_LOVELY_KISS>": 253,
    "<MOVE_ICE_PUNCH>": 254,
    "<MOVE_THUNDERPUNCH>": 255,
    "<MOVE_FIRE_PUNCH>": 256,
    "<MOVE_THUNDER_WAVE>": 257,
    "<MOVE_ROAR>": 258,
    "<MOVE_BIDE>": 259,
    "<MOVE_TELEPORT>": 260,
    "<MOVE_HYPER_FANG>": 261,
    "<MOVE_HYPNOSIS>": 262,
    "<MOVE_BARRAGE>": 263,
    "<MOVE_RAGE>": 264,
    "<MOVE_GROWTH>": 265,
    "<MOVE_FIRE_SPIN>": 266,
    "<MOVE_SLASH>": 267,
    "<MOVE_SPIKE_CANNON>": 268,
    "<MOVE_BODY_SLAM>": 269,
    "<MOVE_REST>": 270,
    "<MOVE_SWIFT>": 271,
    "<MOVE_GROWL>": 272,
    "<MOVE_LEER>": 273,
    "<MOVE_SAND_ATTACK>": 274,
    "<MOVE_GUST>": 275,
    "<MOVE_POISON_POWDER>": 276,
    "<UNKNOWN_PKMN>": 1000,
    "<PKMN_BULBASAUR>": 1001,
    "<PKMN_IVYSAUR>": 1002,
    "<PKMN_VENUSAUR>": 1003,
    "<PKMN_CHARMANDER>": 1004,
    "<PKMN_CHARMELEON>": 1005,
    "<PKMN_CHARIZARD>": 1006,
    "<PKMN_SQUIRTLE>": 1007,
    "<PKMN_WARTORTLE>": 1008,
    "<PKMN_BLASTOISE>": 1009,
    "<PKMN_CATERPIE>": 1010,
    "<PKMN_METAPOD>": 1011,
    "<PKMN_BUTTERFREE>": 1012,
    "<PKMN_WEEDLE>": 1013,
    "<PKMN_KAKUNA>": 1014,
    "<PKMN_BEEDRILL>": 1015,
    "<PKMN_PIDGEY>": 1016,
    "<PKMN_PIDGEOTTO>": 1017,
    "<PKMN_PIDGEOT>": 1018,
    "<PKMN_RATTATA>": 1019,
    "<PKMN_RATICATE>": 1020,
    "<PKMN_SPEAROW>": 1021,
    "<PKMN_FEAROW>": 1022,
    "<PKMN_EKANS>": 1023,
    "<PKMN_ARBOK>": 1024,
    "<PKMN_PIKACHU>": 1025,
    "<PKMN_RAICHU>": 1026,
    "<PKMN_SANDSHREW>": 1027,
    "<PKMN_SANDSLASH>": 1028,
    "<PKMN_NIDORAN_F>": 1029,
    "<PKMN_NIDORINA>": 1030,
    "<PKMN_NIDOQUEEN>": 1031,
    "<PKMN_NIDORAN_M>": 1032,
    "<PKMN_NIDORINO>": 1033,
    "<PKMN_NIDOKING>": 1034,
    "<PKMN_CLEFAIRY>": 1035,
    "<PKMN_CLEFABLE>": 1036,
    "<PKMN_VULPIX>": 1037,
    "<PKMN_NINETALES>": 1038,
    "<PKMN_JIGGLYPUFF>": 1039,
    "<PKMN_WIGGLYTUFF>": 1040,
    "<PKMN_ZUBAT>": 1041,
    "<PKMN_GOLBAT>": 1042,
    "<PKMN_ODDISH>": 1043,
    "<PKMN_GLOOM>": 1044,
    "<PKMN_VILEPLUME>": 1045,
    "<PKMN_PARAS>": 1046,
    "<PKMN_PARASECT>": 1047,
    "<PKMN_VENONAT>": 1048,
    "<PKMN_VENOMOTH>": 1049,
    "<PKMN_DIGLETT>": 1050,
    "<PKMN_DUGTRIO>": 1051,
    "<PKMN_MEOWTH>": 1052,
    "<PKMN_PERSIAN>": 1053,
    "<PKMN_PSYDUCK>": 1054,
    "<PKMN_GOLDUCK>": 1055,
    "<PKMN_MANKEY>": 1056,
    "<PKMN_PRIMEAPE>": 1057,
    "<PKMN_GROWLITHE>": 1058,
    "<PKMN_ARCANINE>": 1059,
    "<PKMN_POLIWAG>": 1060,
    "<PKMN_POLIWHIRL>": 1061,
    "<PKMN_POLIWRATH>": 1062,
    "<PKMN_ABRA>": 1063,
    "<PKMN_KADABRA>": 1064,
    "<PKMN_ALAKAZAM>": 1065,
    "<PKMN_MACHOP>": 1066,
    "<PKMN_MACHOKE>": 1067,
    "<PKMN_MACHAMP>": 1068,
    "<PKMN_BELLSPROUT>": 1069,
    "<PKMN_WEEPINBELL>": 1070,
    "<PKMN_VICTREEBEL>": 1071,
    "<PKMN_TENTACOOL>": 1072,
    "<PKMN_TENTACRUEL>": 1073,
    "<PKMN_GEODUDE>": 1074,
    "<PKMN_GRAVELER>": 1075,
    "<PKMN_GOLEM>": 1076,
    "<PKMN_PONYTA>": 1077,
    "<PKMN_RAPIDASH>": 1078,
    "<PKMN_SLOWPOKE>": 1079,
    "<PKMN_SLOWBRO>": 1080,
    "<PKMN_MAGNEMITE>": 1081,
    "<PKMN_MAGNETON>": 1082,
    "<PKMN_FARFETCH'D>": 1083,
    "<PKMN_DODUO>": 1084,
    "<PKMN_DODRIO>": 1085,
    "<PKMN_SEEL>": 1086,
    "<PKMN_DEWGONG>": 1087,
    "<PKMN_GRIMER>": 1088,
    "<PKMN_MUK>": 1089,
    "<PKMN_SHELLDER>": 1090,
    "<PKMN_CLOYSTER>": 1091,
    "<PKMN_GASTLY>": 1092,
    "<PKMN_HAUNTER>": 1093,
    "<PKMN_GENGAR>": 1094,
    "<PKMN_ONIX>": 1095,
    "<PKMN_DROWZEE>": 1096,
    "<PKMN_HYPNO>": 1097,
    "<PKMN_KRABBY>": 1098,
    "<PKMN_KINGLER>": 1099,
    "<PKMN_VOLTORB>": 1100,
    "<PKMN_ELECTRODE>": 1101,
    "<PKMN_EXEGGCUTE>": 1102,
    "<PKMN_EXEGGUTOR>": 1103,
    "<PKMN_CUBONE>": 1104,
    "<PKMN_MAROWAK>": 1105,
    "<PKMN_HITMONLEE>": 1106,
    "<PKMN_HITMONCHAN>": 1107,
    "<PKMN_LICKITUNG>": 1108,
    "<PKMN_KOFFING>": 1109,
    "<PKMN_WEEZING>": 1110,
    "<PKMN_RHYHORN>": 1111,
    "<PKMN_RHYDON>": 1112,
    "<PKMN_CHANSEY>": 1113,
    "<PKMN_TANGELA>": 1114,
    "<PKMN_KANGASKHAN>": 1115,
    "<PKMN_HORSEA>": 1116,
    "<PKMN_SEADRA>": 1117,
    "<PKMN_GOLDEEN>": 1118,
    "<PKMN_SEAKING>": 1119,
    "<PKMN_STARYU>": 1120,
    "<PKMN_STARMIE>": 1121,
    "<PKMN_MR._MIME>": 1122,
    "<PKMN_SCYTHER>": 1123,
    "<PKMN_JYNX>": 1124,
    "<PKMN_ELECTABUZZ>": 1125,
    "<PKMN_MAGMAR>": 1126,
    "<PKMN_PINSIR>": 1127,
    "<PKMN_TAUROS>": 1128,
    "<PKMN_MAGIKARP>": 1129,
    "<PKMN_GYARADOS>": 1130,
    "<PKMN_LAPRAS>": 1131,
    "<PKMN_DITTO>": 1132,
    "<PKMN_EEVEE>": 1133,
    "<PKMN_VAPOREON>": 1134,
    "<PKMN_JOLTEON>": 1135,
    "<PKMN_FLAREON>": 1136,
    "<PKMN_PORYGON>": 1137,
    "<PKMN_OMANYTE>": 1138,
    "<PKMN_OMASTAR>": 1139,
    "<PKMN_KABUTO>": 1140,
    "<PKMN_KABUTOPS>": 1141,
    "<PKMN_AERODACTYL>": 1142,
    "<PKMN_SNORLAX>": 1143,
    "<PKMN_ARTICUNO>": 1144,
    "<PKMN_ZAPDOS>": 1145,
    "<PKMN_MOLTRES>": 1146,
    "<PKMN_DRATINI>": 1147,
    "<PKMN_DRAGONAIR>": 1148,
    "<PKMN_DRAGONITE>": 1149,
    "<PKMN_MEWTWO>": 1150,
    "<PKMN_MEW>": 1151
}