{
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "<UNKNOWN_WORD>": 5,
    "<FACT>": 10,
    "<QUERY>": 11,
    "<STATE>": 12,
    "<ANSWER>": 13,
    "<BATTLE>": 14,
    "<TURN>": 30,
    "<HP_REMAINING>": 31,
    "<FAINTED>": 32,
    "<BATTLE_WON>": 33,
    "<BATTLE_LOST>": 34,
    "<HAS>": 35,
    "<IS>": 36,
    "<TYPE>": 37,
    "<ACTION_USE>": 38,
    "<TARGET_AGAINST>": 39,
    "<TARGET_ON>": 40,
    "<EFFECT_SUPER>": 41,
    "<EFFECT_NORMAL>": 42,
    "<EFFECT_WEAK>": 43,
    "<EFFECT_NONE>": 44,
    "<BASE_HP>": 45,
    "<EVOLVES_INTO>": 46,
    "<POWER>": 47,
    "<OBTAINED_FROM>": 48,
    "<EFFECT_FELL_ASLEEP>": 49,
    "<EFFECT_FAST_ASLEEP>": 50,
    "<EFFECT_HURT_BIND>": 51,
    "<EFFECT_RESTORED_SLEEP>": 52,
    "<EFFECT_MISSED>": 53,
    "<TARGET_ITSELF>": 54,
    "<PLAYER>": 55,
    "<WITHDREW>": 57,
    "<SENT_OUT>": 58,
    "<HAS_MOVES>": 63,
    "<EFFECT_MUTUAL_FAINT>": 64,
    "<LOGIC_AND>": 70,
    "<LOGIC_OR>": 71,
    "<LOGIC_NOT>": 72,
    "<LOGIC_TRUE>": 73,
    "<LOGIC_FALSE>": 74,
    "<LOGIC_LPAREN>": 75,
    "<LOGIC_RPAREN>": 76,
    "<PLAYER_VS_LEADER>": 80,
    "<HAS_1_LEFT>": 81,
    "<HAS_2_LEFT>": 82,
    "<HAS_3_LEFT>": 83,
    "<VS>": 84,
    "<LEADER>": 85,
    "<AND>": 86,
    "<UNKNOWN_TYPE>": 100,
    "<TYPE_NORMAL>": 101,
    "<TYPE_FIRE>": 102,
    "<TYPE_WATER>": 103,
    "<TYPE_GRASS>": 104,
    "<TYPE_ELECTRIC>": 105,
    "<TYPE_ICE>": 106,
    "<TYPE_FIGHTING>": 107,
    "<TYPE_POISON>": 108,
    "<TYPE_GROUND>": 109,
    "<TYPE_FLYING>": 110,
    "<TYPE_PSYCHIC>": 111,
    "<TYPE_BUG>": 112,
    "<TYPE_ROCK>": 113,
    "<TYPE_GHOST>": 114,
    "<TYPE_DRAGON>": 115,
    "<TYPE_DARK>": 116,
    "<TYPE_STEEL>": 117,
    "<TYPE_FAIRY>": 118,
    "<UNKNOWN_POWER>": 199,
    "<UNKNOWN_MOVE>": 200,
    "<MOVE_ABSORB>": 201,
    "<MOVE_ACID>": 202,
    "<MOVE_AGILITY>": 203,
    "<MOVE_ANCIENT_POWER>": 204,
    "<MOVE_AURORA_BEAM>": 205,
    "<MOVE_BARRAGE>": 206,
    "<MOVE_BIDE>": 207,
    "<MOVE_BIND>": 208,
    "<MOVE_BITE>": 209,
    "<MOVE_BLIZZARD>": 210,
    "<MOVE_BODY_SLAM>": 211,
    "<MOVE_BONE_CLUB>": 212,
    "<MOVE_BONE_RUSH>": 213,
    "<MOVE_BONEMERANG>": 214,
    "<MOVE_BUBBLE>": 215,
    "<MOVE_BUBBLE_BEAM>": 216,
    "<MOVE_BUBBLEBEAM>": 217,
    "<MOVE_CLAMP>": 218,
    "<MOVE_COMET_PUNCH>": 219,
    "<MOVE_CONFUSE_RAY>": 220,
    "<MOVE_CONFUSION>": 221,
    "<MOVE_CONSTRICT>": 222,
    "<MOVE_COUNTER>": 223,
    "<MOVE_CRABHAMMER>": 224,
    "<MOVE_CROSS_CHOP>": 225,
    "<MOVE_CRUNCH>": 226,
    "<MOVE_CUT>": 227,
    "<MOVE_DIG>": 228,
    "<MOVE_DIZZY_PUNCH>": 229,
    "<MOVE_DOUBLE_EDGE>": 230,
    "<MOVE_DOUBLE_KICK>": 231,
    "<MOVE_DOUBLE_SLAP>": 232,
    "<MOVE_DRAGON_BREATH>": 233,
    "<MOVE_DRAGON_RAGE>": 234,
    "<MOVE_DREAM_EATER>": 235,
    "<MOVE_DRILL_PECK>": 236,
    "<MOVE_DYNAMIC_PUNCH>": 237,
    "<MOVE_EARTHQUAKE>": 238,
    "<MOVE_EGG_BOMB>": 239,
    "<MOVE_EMBER>": 240,
    "<MOVE_EXPLOSION>": 241,
    "<MOVE_EXTREME_SPEED>": 242,
    "<MOVE_FALSE_SWIPE>": 243,
    "<MOVE_FEINT_ATTACK>": 244,
    "<MOVE_FIRE_BLAST>": 245,
    "<MOVE_FIRE_PUNCH>": 246,
    "<MOVE_FIRE_SPIN>": 247,
    "<MOVE_FISSURE>": 248,
    "<MOVE_FLAME_WHEEL>": 249,
    "<MOVE_FLAMETHROWER>": 250,
    "<MOVE_FLY>": 251,
    "<MOVE_FURY_ATTACK>": 252,
    "<MOVE_FURY_CUTTER>": 253,
    "<MOVE_FURY_SWIPES>": 254,
    "<MOVE_FUTURE_SIGHT>": 255,
    "<MOVE_GIGA_DRAIN>": 256,
    "<MOVE_GLARE>": 257,
    "<MOVE_GROWL>": 258,
    "<MOVE_GROWTH>": 259,
    "<MOVE_GUST>": 260,
    "<MOVE_HARDEN>": 261,
    "<MOVE_HEADBUTT>": 262,
    "<MOVE_HIDDEN_POWER>": 263,
    "<MOVE_HIGH_JUMP_KICK>": 264,
    "<MOVE_HORN_ATTACK>": 265,
    "<MOVE_HYDRO_PUMP>": 266,
    "<MOVE_HYPER_BEAM>": 267,
    "<MOVE_HYPER_FANG>": 268,
    "<MOVE_HYPNOSIS>": 269,
    "<MOVE_ICE_BEAM>": 270,
    "<MOVE_ICE_PUNCH>": 271,
    "<MOVE_ICY_WIND>": 272,
    "<MOVE_IRON_TAIL>": 273,
    "<MOVE_JUMP_KICK>": 274,
    "<MOVE_KARATE_CHOP>": 275,
    "<MOVE_LEECH_LIFE>": 276,
    "<MOVE_LEECH_SEED>": 277,
    "<MOVE_LEER>": 278,
    "<MOVE_LICK>": 279,
    "<MOVE_LIGHT_SCREEN>": 280,
    "<MOVE_LOVELY_KISS>": 281,
    "<MOVE_LOW_KICK>": 282,
    "<MOVE_MACH_PUNCH>": 283,
    "<MOVE_MEGA_DRAIN>": 284,
    "<MOVE_MEGA_KICK>": 285,
    "<MOVE_MEGA_PUNCH>": 286,
    "<MOVE_MEGAHORN>": 287,
    "<MOVE_METAL_CLAW>": 288,
    "<MOVE_MUD_SLAP>": 289,
    "<MOVE_NIGHT_SHADE>": 290,
    "<MOVE_OCTAZOOKA>": 291,
    "<MOVE_OUTRAGE>": 292,
    "<MOVE_PAY_DAY>": 293,
    "<MOVE_PECK>": 294,
    "<MOVE_PETAL_DANCE>": 295,
    "<MOVE_PIN_MISSILE>": 296,
    "<MOVE_POISON_POWDER>": 297,
    "<MOVE_POISON_STING>": 298,
    "<MOVE_POUND>": 299,
    "<MOVE_POWDER_SNOW>": 300,
    "<MOVE_PSYBEAM>": 301,
    "<MOVE_PSYCHIC>": 302,
    "<MOVE_PSYWAVE>": 303,
    "<MOVE_PURSUIT>": 304,
    "<MOVE_QUICK_ATTACK>": 305,
    "<MOVE_RAGE>": 306,
    "<MOVE_RAPID_SPIN>": 307,
    "<MOVE_RAZOR_LEAF>": 308,
    "<MOVE_RAZOR_WIND>": 309,
    "<MOVE_RECOVER>": 310,
    "<MOVE_REFLECT>": 311,
    "<MOVE_REST>": 312,
    "<MOVE_ROAR>": 313,
    "<MOVE_ROCK_SLIDE>": 314,
    "<MOVE_ROCK_SMASH>": 315,
    "<MOVE_ROCK_THROW>": 316,
    "<MOVE_ROLLING_KICK>": 317,
    "<MOVE_ROLLOUT>": 318,
    "<MOVE_SACRED_FIRE>": 319,
    "<MOVE_SAND_ATTACK>": 320,
    "<MOVE_SCRATCH>": 321,
    "<MOVE_SELF_DESTRUCT>": 322,
    "<MOVE_SHADOW_BALL>": 323,
    "<MOVE_SKETCH>": 324,
    "<MOVE_SKULL_BASH>": 325,
    "<MOVE_SKY_ATTACK>": 326,
    "<MOVE_SLAM>": 327,
    "<MOVE_SLASH>": 328,
    "<MOVE_SLEEP_POWDER>": 329,
    "<MOVE_SLUDGE>": 330,
    "<MOVE_SLUDGE_BOMB>": 331,
    "<MOVE_SMOG>": 332,
    "<MOVE_SNORE>": 333,
    "<MOVE_SOLAR_BEAM>": 334,
    "<MOVE_SOLARBEAM>": 335,
    "<MOVE_SONICBOOM>": 336,
    "<MOVE_SPARK>": 337,
    "<MOVE_SPIKE_CANNON>": 338,
    "<MOVE_STEEL_WING>": 339,
    "<MOVE_STOMP>": 340,
    "<MOVE_STRENGTH>": 341,
    "<MOVE_STRUGGLE>": 342,
    "<MOVE_STUN_SPORE>": 343,
    "<MOVE_SUBMISSION>": 344,
    "<MOVE_SUPERSONIC>": 345,
    "<MOVE_SURF>": 346,
    "<MOVE_SWIFT>": 347,
    "<MOVE_TACKLE>": 348,
    "<MOVE_TAKE_DOWN>": 349,
    "<MOVE_TELEPORT>": 350,
    "<MOVE_THIEF>": 351,
    "<MOVE_THRASH>": 352,
    "<MOVE_THUNDER>": 353,
    "<MOVE_THUNDER_PUNCH>": 354,
    "<MOVE_THUNDER_SHOCK>": 355,
    "<MOVE_THUNDER_WAVE>": 356,
    "<MOVE_THUNDERBOLT>": 357,
    "<MOVE_THUNDERPUNCH>": 358,
    "<MOVE_THUNDERSHOCK>": 359,
    "<MOVE_TOXIC>": 360,
    "<MOVE_TRANSFORM>": 361,
    "<MOVE_TRI_ATTACK>": 362,
    "<MOVE_TWINEEDLE>": 363,
    "<MOVE_TWISTER>": 364,
    "<MOVE_VICE_GRIP>": 365,
    "<MOVE_VINE_WHIP>": 366,
    "<MOVE_VITAL_THROW>": 367,
    "<MOVE_WATER_GUN>": 368,
    "<MOVE_WATERFALL>": 369,
    "<MOVE_WHIRLPOOL>": 370,
    "<MOVE_WING_ATTACK>": 371,
    "<MOVE_WRAP>": 372,
    "<MOVE_ZAP_CANNON>": 373,
    "<MOVE_METRONOME>": 374,
    "<MOVE_ENCORE>": 375,
    "<MOVE_DISABLE>": 376,
    "<MOVE_MIRROR_MOVE>": 377,
    "<MOVE_SING>": 378,
    "<MOVE_COPYCAT>": 379,
    "<ENC_UNOBTAINABLE_WILD>": 900,
    "<ENC_COMMON_WILD>": 901,
    "<ENC_UNCOMMON_WILD>": 902,
    "<ENC_RARE_WILD>": 903,
    "<ENC_LEGENDARY>": 904,
    "<ENC_GIFT>": 910,
    "<ENC_FISHING>": 911,
    "<ENC_FOSSIL>": 912,
    "<ENC_EVOLUTION>": 913,
    "<ENC_HATCHABLE>": 914,
    "<ATTACKER>": 915,
    "<TARGET>": 916,
    "<UNKNOWN_PKMN>": 1000,
    "<PKMN_BULBASAUR>": 1001,
    "<PKMN_IVYSAUR>": 1002,
    "<PKMN_VENUSAUR>": 1003,
    "<PKMN_CHARMANDER>": 1004,
    "<PKMN_CHARMELEON>": 1005,
    "<PKMN_CHARIZARD>": 1006,
    "<PKMN_SQUIRTLE>": 1007,
    "<PKMN_WARTORTLE>": 1008,
    "<PKMN_BLASTOISE>": 1009,
    "<PKMN_CATERPIE>": 1010,
    "<PKMN_METAPOD>": 1011,
    "<PKMN_BUTTERFREE>": 1012,
    "<PKMN_WEEDLE>": 1013,
    "<PKMN_KAKUNA>": 1014,
    "<PKMN_BEEDRILL>": 1015,
    "<PKMN_PIDGEY>": 1016,
    "<PKMN_PIDGEOTTO>": 1017,
    "<PKMN_PIDGEOT>": 1018,
    "<PKMN_RATTATA>": 1019,
    "<PKMN_RATICATE>": 1020,
    "<PKMN_SPEAROW>": 1021,
    "<PKMN_FEAROW>": 1022,
    "<PKMN_EKANS>": 1023,
    "<PKMN_ARBOK>": 1024,
    "<PKMN_PIKACHU>": 1025,
    "<PKMN_RAICHU>": 1026,
    "<PKMN_SANDSHREW>": 1027,
    "<PKMN_SANDSLASH>": 1028,
    "<PKMN_NIDORANF>": 1029,
    "<PKMN_NIDORINA>": 1030,
    "<PKMN_NIDOQUEEN>": 1031,
    "<PKMN_NIDORANM>": 1032,
    "<PKMN_NIDORINO>": 1033,
    "<PKMN_NIDOKING>": 1034,
    "<PKMN_CLEFAIRY>": 1035,
    "<PKMN_CLEFABLE>": 1036,
    "<PKMN_VULPIX>": 1037,
    "<PKMN_NINETALES>": 1038,
    "<PKMN_JIGGLYPUFF>": 1039,
    "<PKMN_WIGGLYTUFF>": 1040,
    "<PKMN_ZUBAT>": 1041,
    "<PKMN_GOLBAT>": 1042,
    "<PKMN_ODDISH>": 1043,
    "<PKMN_GLOOM>": 1044,
    "<PKMN_VILEPLUME>": 1045,
    "<PKMN_PARAS>": 1046,
    "<PKMN_PARASECT>": 1047,
    "<PKMN_VENONAT>": 1048,
    "<PKMN_VENOMOTH>": 1049,
    "<PKMN_DIGLETT>": 1050,
    "<PKMN_DUGTRIO>": 1051,
    "<PKMN_MEOWTH>": 1052,
    "<PKMN_PERSIAN>": 1053,
    "<PKMN_PSYDUCK>": 1054,
    "<PKMN_GOLDUCK>": 1055,
    "<PKMN_MANKEY>": 1056,
    "<PKMN_PRIMEAPE>": 1057,
    "<PKMN_GROWLITHE>": 1058,
    "<PKMN_ARCANINE>": 1059,
    "<PKMN_POLIWAG>": 1060,
    "<PKMN_POLIWHIRL>": 1061,
    "<PKMN_POLIWRATH>": 1062,
    "<PKMN_ABRA>": 1063,
    "<PKMN_KADABRA>": 1064,
    "<PKMN_ALAKAZAM>": 1065,
    "<PKMN_MACHOP>": 1066,
    "<PKMN_MACHOKE>": 1067,
    "<PKMN_MACHAMP>": 1068,
    "<PKMN_BELLSPROUT>": 1069,
    "<PKMN_WEEPINBELL>": 1070,
    "<PKMN_VICTREEBEL>": 1071,
    "<PKMN_TENTACOOL>": 1072,
    "<PKMN_TENTACRUEL>": 1073,
    "<PKMN_GEODUDE>": 1074,
    "<PKMN_GRAVELER>": 1075,
    "<PKMN_GOLEM>": 1076,
    "<PKMN_PONYTA>": 1077,
    "<PKMN_RAPIDASH>": 1078,
    "<PKMN_SLOWPOKE>": 1079,
    "<PKMN_SLOWBRO>": 1080,
    "<PKMN_MAGNEMITE>": 1081,
    "<PKMN_MAGNETON>": 1082,
    "<PKMN_FARFETCH'D>": 1083,
    "<PKMN_DODUO>": 1084,
    "<PKMN_DODRIO>": 1085,
    "<PKMN_SEEL>": 1086,
    "<PKMN_DEWGONG>": 1087,
    "<PKMN_GRIMER>": 1088,
    "<PKMN_MUK>": 1089,
    "<PKMN_SHELLDER>": 1090,
    "<PKMN_CLOYSTER>": 1091,
    "<PKMN_GASTLY>": 1092,
    "<PKMN_HAUNTER>": 1093,
    "<PKMN_GENGAR>": 1094,
    "<PKMN_ONIX>": 1095,
    "<PKMN_DROWZEE>": 1096,
    "<PKMN_HYPNO>": 1097,
    "<PKMN_KRABBY>": 1098,
    "<PKMN_KINGLER>": 1099,
    "<PKMN_VOLTORB>": 1100,
    "<PKMN_ELECTRODE>": 1101,
    "<PKMN_EXEGGCUTE>": 1102,
    "<PKMN_EXEGGUTOR>": 1103,
    "<PKMN_CUBONE>": 1104,
    "<PKMN_MAROWAK>": 1105,
    "<PKMN_HITMONLEE>": 1106,
    "<PKMN_HITMONCHAN>": 1107,
    "<PKMN_LICKITUNG>": 1108,
    "<PKMN_KOFFING>": 1109,
    "<PKMN_WEEZING>": 1110,
    "<PKMN_RHYHORN>": 1111,
    "<PKMN_RHYDON>": 1112,
    "<PKMN_CHANSEY>": 1113,
    "<PKMN_TANGELA>": 1114,
    "<PKMN_KANGASKHAN>": 1115,
    "<PKMN_HORSEA>": 1116,
    "<PKMN_SEADRA>": 1117,
    "<PKMN_GOLDEEN>": 1118,
    "<PKMN_SEAKING>": 1119,
    "<PKMN_STARYU>": 1120,
    "<PKMN_STARMIE>": 1121,
    "<PKMN_MR._MIME>": 1122,
    "<PKMN_SCYTHER>": 1123,
    "<PKMN_JYNX>": 1124,
    "<PKMN_ELECTABUZZ>": 1125,
    "<PKMN_MAGMAR>": 1126,
    "<PKMN_PINSIR>": 1127,
    "<PKMN_TAUROS>": 1128,
    "<PKMN_MAGIKARP>": 1129,
    "<PKMN_GYARADOS>": 1130,
    "<PKMN_LAPRAS>": 1131,
    "<PKMN_DITTO>": 1132,
    "<PKMN_EEVEE>": 1133,
    "<PKMN_VAPOREON>": 1134,
    "<PKMN_JOLTEON>": 1135,
    "<PKMN_FLAREON>": 1136,
    "<PKMN_PORYGON>": 1137,
    "<PKMN_OMANYTE>": 1138,
    "<PKMN_OMASTAR>": 1139,
    "<PKMN_KABUTO>": 1140,
    "<PKMN_KABUTOPS>": 1141,
    "<PKMN_AERODACTYL>": 1142,
    "<PKMN_SNORLAX>": 1143,
    "<PKMN_ARTICUNO>": 1144,
    "<PKMN_ZAPDOS>": 1145,
    "<PKMN_MOLTRES>": 1146,
    "<PKMN_DRATINI>": 1147,
    "<PKMN_DRAGONAIR>": 1148,
    "<PKMN_DRAGONITE>": 1149,
    "<PKMN_MEWTWO>": 1150,
    "<PKMN_MEW>": 1151,
    "<PKMN_CHIKORITA>": 1152,
    "<PKMN_BAYLEEF>": 1153,
    "<PKMN_MEGANIUM>": 1154,
    "<PKMN_CYNDAQUIL>": 1155,
    "<PKMN_QUILAVA>": 1156,
    "<PKMN_TYPHLOSION>": 1157,
    "<PKMN_TOTODILE>": 1158,
    "<PKMN_CROCONAW>": 1159,
    "<PKMN_FERALIGATR>": 1160,
    "<PKMN_SENTRET>": 1161,
    "<PKMN_FURRET>": 1162,
    "<PKMN_HOOTHOOT>": 1163,
    "<PKMN_NOCTOWL>": 1164,
    "<PKMN_LEDYBA>": 1165,
    "<PKMN_LEDIAN>": 1166,
    "<PKMN_SPINARAK>": 1167,
    "<PKMN_ARIADOS>": 1168,
    "<PKMN_CROBAT>": 1169,
    "<PKMN_CHINCHOU>": 1170,
    "<PKMN_LANTURN>": 1171,
    "<PKMN_PICHU>": 1172,
    "<PKMN_CLEFFA>": 1173,
    "<PKMN_IGGLYBUFF>": 1174,
    "<PKMN_TOGEPI>": 1175,
    "<PKMN_TOGETIC>": 1176,
    "<PKMN_NATU>": 1177,
    "<PKMN_XATU>": 1178,
    "<PKMN_MAREEP>": 1179,
    "<PKMN_FLAAFFY>": 1180,
    "<PKMN_AMPHAROS>": 1181,
    "<PKMN_BELLOSSOM>": 1182,
    "<PKMN_MARILL>": 1183,
    "<PKMN_AZUMARILL>": 1184,
    "<PKMN_SUDOWOODO>": 1185,
    "<PKMN_POLITOED>": 1186,
    "<PKMN_HOPPIP>": 1187,
    "<PKMN_SKIPLOOM>": 1188,
    "<PKMN_JUMPLUFF>": 1189,
    "<PKMN_AIPOM>": 1190,
    "<PKMN_SUNKERN>": 1191,
    "<PKMN_SUNFLORA>": 1192,
    "<PKMN_YANMA>": 1193,
    "<PKMN_WOOPER>": 1194,
    "<PKMN_QUAGSIRE>": 1195,
    "<PKMN_ESPEON>": 1196,
    "<PKMN_UMBREON>": 1197,
    "<PKMN_MURKROW>": 1198,
    "<PKMN_SLOWKING>": 1199,
    "<PKMN_MISDREAVUS>": 1200,
    "<PKMN_UNOWN>": 1201,
    "<PKMN_WOBBUFFET>": 1202,
    "<PKMN_GIRAFARIG>": 1203,
    "<PKMN_PINECO>": 1204,
    "<PKMN_FORRETRESS>": 1205,
    "<PKMN_DUNSPARCE>": 1206,
    "<PKMN_GLIGAR>": 1207,
    "<PKMN_STEELIX>": 1208,
    "<PKMN_SNUBBULL>": 1209,
    "<PKMN_GRANBULL>": 1210,
    "<PKMN_QWILFISH>": 1211,
    "<PKMN_SCIZOR>": 1212,
    "<PKMN_SHUCKLE>": 1213,
    "<PKMN_HERACROSS>": 1214,
    "<PKMN_SNEASEL>": 1215,
    "<PKMN_TEDDIURSA>": 1216,
    "<PKMN_URSARING>": 1217,
    "<PKMN_SLUGMA>": 1218,
    "<PKMN_MAGCARGO>": 1219,
    "<PKMN_SWINUB>": 1220,
    "<PKMN_PILOSWINE>": 1221,
    "<PKMN_CORSOLA>": 1222,
    "<PKMN_REMORAID>": 1223,
    "<PKMN_OCTILLERY>": 1224,
    "<PKMN_DELIBIRD>": 1225,
    "<PKMN_MANTINE>": 1226,
    "<PKMN_SKARMORY>": 1227,
    "<PKMN_HOUNDOUR>": 1228,
    "<PKMN_HOUNDOOM>": 1229,
    "<PKMN_KINGDRA>": 1230,
    "<PKMN_PHANPY>": 1231,
    "<PKMN_DONPHAN>": 1232,
    "<PKMN_PORYGON2>": 1233,
    "<PKMN_STANTLER>": 1234,
    "<PKMN_SMEARGLE>": 1235,
    "<PKMN_TYROGUE>": 1236,
    "<PKMN_HITMONTOP>": 1237,
    "<PKMN_SMOOCHUM>": 1238,
    "<PKMN_ELEKID>": 1239,
    "<PKMN_MAGBY>": 1240,
    "<PKMN_MILTANK>": 1241,
    "<PKMN_BLISSEY>": 1242,
    "<PKMN_RAIKOU>": 1243,
    "<PKMN_ENTEI>": 1244,
    "<PKMN_SUICUNE>": 1245,
    "<PKMN_LARVITAR>": 1246,
    "<PKMN_PUPITAR>": 1247,
    "<PKMN_TYRANITAR>": 1248,
    "<PKMN_LUGIA>": 1249,
    "<PKMN_HO-OH>": 1250,
    "<PKMN_CELEBI>": 1251,
    "<-100>": 2000,
    "<-90>": 2001,
    "<-80>": 2002,
    "<-70>": 2003,
    "<-60>": 2004,
    "<-50>": 2005,
    "<-40>": 2006,
    "<-30>": 2007,
    "<-20>": 2008,
    "<-10>": 2009,
    "<0>": 2010,
    "<10>": 2011,
    "<20>": 2012,
    "<30>": 2013,
    "<40>": 2014,
    "<50>": 2015,
    "<60>": 2016,
    "<70>": 2017,
    "<80>": 2018,
    "<90>": 2019,
    "<100>": 2020,
    "<110>": 2021,
    "<120>": 2022,
    "<130>": 2023,
    "<140>": 2024,
    "<150>": 2025,
    "<160>": 2026,
    "<170>": 2027,
    "<180>": 2028,
    "<190>": 2029,
    "<200>": 2030,
    "<210>": 2031,
    "<220>": 2032,
    "<230>": 2033,
    "<240>": 2034,
    "<250>": 2035,
    "<260>": 2036,
    "<270>": 2037,
    "<280>": 2038,
    "<290>": 2039,
    "<300>": 2040,
    "<310>": 2041,
    "<320>": 2042,
    "<330>": 2043,
    "<340>": 2044,
    "<350>": 2045,
    "<360>": 2046,
    "<370>": 2047,
    "<380>": 2048,
    "<390>": 2049,
    "<400>": 2050,
    "<410>": 2051,
    "<420>": 2052,
    "<430>": 2053,
    "<440>": 2054,
    "<450>": 2055,
    "<460>": 2056,
    "<470>": 2057,
    "<480>": 2058,
    "<490>": 2059,
    "<500>": 2060
}